Revit 2026 API
GlobalParametersManager Class
 A class to access and query information about global parameters in Revit models.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GlobalParametersManager
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class GlobalParametersManager : IDisposable
Public Class GlobalParametersManager
	Implements IDisposable
public ref class GlobalParametersManager : IDisposable
type GlobalParametersManager =
    class
        interface IDisposable
    end
The GlobalParametersManager type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AreGlobalParametersAllowed |  Tests whether global parameters are allowed in the given document.
Dispose | Releases all resources used by the GlobalParametersManager
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
FindByName |  Finds whether a global parameter with the given name exists in the input document.
GetAllGlobalParameters |  Returns all global parameters available in the given document.
GetGlobalParametersOrdered |  Returns all global paramters in an ordered array.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsUniqueName |  Tests whether a name is unique among existing global parameters of a given document.
IsValidGlobalParameter |  Tests whether an ElementId is of a global parameter in the given document.
MoveParameterDownOrder |  Moves given paramerer Down in the current order.
MoveParameterUpOrder |  Moves given paramerer Up in the current order.
SortParameters |  Sorts global parameters in the desired order.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
This class provides access to general information and data of Global Parameter elements in a particular model. First of all, it is important to know that global parameters can be had in main project document; there are not supported in family documents. Availability of global parameters in a document can be tested by calling AreGlobalParametersAllowed(Document) method.
Global Parameter in a document can be obtained by calling either GetAllGlobalParameters(Document) or FindByName(Document, String). The former returns a set of all global parameters in the document, while the latter returns just the requested one, providing it exists.
Each global parameters must be created with a valid name that is unique in the scope of the document. To test whether a particular name is unique, programmer can use the IsUniqueName(Document, String) method.
More details about creating and manipulating global parameters can be found in the description of the GlobalParameter class.
See Also
Reference
Autodesk.Revit.DB Namespace